/********************************************************************************************************:
Author   : the.lumw@gmail.com
文件描述 :
    OCILib接口封装函数(实现文件部分)

修改记录 :
========================================================================================================
序号    修改日期            修改人                      修改原因
1       2014-05-22          the.lumw@gmail.com          创建版本
********************************************************************************************************/

#include "OracleDB.h"
#include "ocilib.h"

OCI_Connection *conn;
OCI_Statement  *stmt;
OCI_Error      *err;
OCI_Resultset  *rs;


/****************************************************************************************************
函数功能:建立与数据库的连接
参数说明:
    const char *userName    用户名
    const char *password    口令
    const char *sid         数据库实例名
输出说明:

****************************************************************************************************/
int ConnectDB(const char* userName, const char* password, const char* sid)
{

    if( !OCI_Initialize(NULL, NULL, OCI_ENV_DEFAULT) )
    {
        return EXIT_FAILURE;
    }

    conn = OCI_ConnectionCreate(sid, userName, password, OCI_SESSION_DEFAULT);

    return EXIT_SUCCESS;
}


/****************************************************************************************************
函数功能:断开与数据库的连接
参数说明:

输出说明:

****************************************************************************************************/
int DisConnectDB()
{
    OCI_Cleanup();
    return EXIT_SUCCESS;
}


/****************************************************************************************************
函数功能:验证终端设备是否合法
参数说明:

输出说明:

****************************************************************************************************/
int check_terminal_legality(const char* terminalID)
{
    stmt = OCI_StatementCreate(conn);

    OCI_Prepare(st, "");


}

